Группа вращений и её алгебра Ли: Следуя стандартной нотации, обозначим через $SO(3)$ группу ортогональных преобразований, то есть $SO(3) := \{A: \mathbb{R}^3 \rightarrow \mathbb{R}^3 \, | \, A'A = AA' = I \text{ и } \det(A) = 1\}$. (1)

Для любого $A \in SO(3)$ существует собственный вектор $\omega \in \mathbb{R}^3$ такой, что $A\omega = \omega$. Геометрически, $A$ представляет собой вращение вокруг вектора $\omega$.

Касательное пространство к $SO(3)$ в единичной точке, обозначаемое $T_{SO(3)}$, является самой группой $SO(3)$. Множество антисимметричных тензоров, определенное как $\mathfrak{so}(3) := \{\xi \in \mathbb{R}^{3 \times 3} \, | \, \xi' = -\xi\}$, выступает в роли алгебры Ли для $SO(3)$. (2)

Для любого $\xi \in \mathfrak{so}(3)$ существует собственный вектор $v \in \mathbb{R}^3$ такой, что $\xi v = 0$. Это определяет изоморфизм $\Omega: \mathfrak{so}(3) \rightarrow \mathbb{R}^3$, заданный соотношением $\xi \mapsto \omega \times v$, где $\times$ обозначает векторное произведение в $\mathbb{R}^3$, а $v$ может быть любым ненулевым вектором в $\mathbb{R}^3$.
